apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rt_timer.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_rt_timer.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this args for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <debug.h>
#include <errno.h>
#include <fcntl.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>

#include <nuttx/nuttx.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>

#include "xtensa.h"
#include "esp_attr.h"
#include "esp32s3_irq.h"
#include "esp32s3_rt_timer.h"
#include "hardware/esp32s3_soc.h"
#include "hardware/esp32s3_system.h"
#include "hardware/esp32s3_systimer.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define RT_TIMER_TASK_NAME        CONFIG_ESP32S3_RT_TIMER_TASK_NAME
#define RT_TIMER_TASK_PRIORITY    CONFIG_ESP32S3_RT_TIMER_TASK_PRIORITY
#define RT_TIMER_TASK_STACK_SIZE  CONFIG_ESP32S3_RT_TIMER_TASK_STACK_SIZE

#ifdef CONFIG_SCHED_HPWORKPRIORITY
static_assert(RT_TIMER_TASK_PRIORITY < CONFIG_SCHED_HPWORKPRIORITY,
  "RT Timer priority should be smaller than high-prio workqueue");
#endif

/* Timer running at 16 MHz */

#define CYCLES_PER_USEC           16
#define USEC_TO_CYCLES(u)         ((u) * CYCLES_PER_USEC)
#define CYCLES_TO_USEC(c)         ((c) / CYCLES_PER_USEC)

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32s3_rt_priv_s
{
  pid_t pid;                  /* PID of RT Timer kernel thread */
  int cpuint;                 /* CPU interrupt assigned to this timer */
  int core;                   /* Core that is taking care of the timer
                               * interrupts
                               */
  sem_t toutsem;              /* Semaphore for synchronizing access to list
                               * of timed-out timers
                               */
  struct list_node runlist;   /* List of timers in the running state */
  struct list_node toutlist;  /* List of timed-out timers */
  spinlock_t lock;            /* Device-specific lock */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct esp32s3_rt_priv_s g_rt_priv =
{
  .pid     = INVALID_PROCESS_ID,
  .cpuint  = -ENOMEM,
  .core    = -ENODEV,
  .toutsem = SEM_INITIALIZER(0),
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: rt_timer_getcounter
 *
 * Description:
 *   Get the current counter value.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Current counter value.
 *
 ****************************************************************************/

static inline uint64_t rt_timer_getcounter(void)
{
  uint32_t lo;
  uint32_t lo_start;
  uint32_t hi;
  uint64_t counter;

  /* Trigger an update event */

  modifyreg32(SYSTIMER_UNIT1_OP_REG, 0, SYSTIMER_TIMER_UNIT1_UPDATE);

  /* Wait until the value is valid */

  while ((getreg32(SYSTIMER_UNIT1_OP_REG) &
          SYSTIMER_TIMER_UNIT1_VALUE_VALID) !=
         SYSTIMER_TIMER_UNIT1_VALUE_VALID);

  /* Read LO, HI, then LO again, check that LO returns the same value.
   * This accounts for the case when an interrupt may happen between reading
   * HI and LO values, and this function may get called from the ISR.
   * In this case, the repeated read will return consistent values.
   */

  lo_start = getreg32(SYSTIMER_UNIT1_VALUE_LO_REG);
  do
    {
      lo = lo_start;
      hi = getreg32(SYSTIMER_UNIT1_VALUE_HI_REG);
      lo_start = getreg32(SYSTIMER_UNIT1_VALUE_LO_REG);
    }
  while (lo_start != lo);

  counter = ((uint64_t) hi << 32) | lo;

  return counter;
}

/****************************************************************************
 * Name: rt_timer_setcounter
 *
 * Description:
 *   Set the counter value.
 *
 * Input Parameters:
 *   value         - The value to be loaded to the counter.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void rt_timer_setcounter(uint64_t value)
{
  /* Set counter value */

  putreg32(value & SYSTIMER_TIMER_UNIT1_VALUE_LO_V,
           SYSTIMER_UNIT1_VALUE_LO_REG);
  putreg32((value >> 32) & SYSTIMER_TIMER_UNIT1_VALUE_HI_V,
           SYSTIMER_UNIT1_VALUE_HI_REG);

  /* Apply counter value */

  putreg32(SYSTIMER_TIMER_UNIT1_LOAD, SYSTIMER_UNIT1_LOAD_REG);
}

/****************************************************************************
 * Name: rt_timer_getalarmvalue
 *
 * Description:
 *   Get the alarm value.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Remaining ticks for expiration.
 *
 ****************************************************************************/

static inline uint64_t rt_timer_getalarmvalue(void)
{
  uint32_t hi = getreg32(SYSTIMER_TARGET2_HI_REG);
  uint32_t lo = getreg32(SYSTIMER_TARGET2_LO_REG);
  uint64_t ticks = ((uint64_t) hi << 32) | lo;

