apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rt_timer.c
  return ticks;
}

/****************************************************************************
 * Name: rt_timer_setalarmvalue
 *
 * Description:
 *   Set the value that will trigger an alarm when the counter value matches
 *   this value.
 *
 * Input Parameters:
 *   value         - The alarm value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void rt_timer_setalarmvalue(uint64_t value)
{
  /* Set alarm value */

  putreg32(value & 0xffffffff, SYSTIMER_TARGET2_LO_REG);
  putreg32((value >> 32) & 0xfffff, SYSTIMER_TARGET2_HI_REG);

  /* Apply alarm value */

  putreg32(SYSTIMER_TIMER_COMP2_LOAD, SYSTIMER_COMP2_LOAD_REG);
}

/****************************************************************************
 * Name: rt_timer_setalarm
 *
 * Description:
 *   Enable/Disable the alarm.
 *
 * Input Parameters:
 *   enable        - A variable to indicate the action. If true, enable
 *                   the alarm, otherwise disable it.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void rt_timer_setalarm(bool enable)
{
  if (enable)
    {
      modifyreg32(SYSTIMER_CONF_REG, 0, SYSTIMER_TARGET2_WORK_EN);
    }
  else
    {
      modifyreg32(SYSTIMER_CONF_REG, SYSTIMER_TARGET2_WORK_EN, 0);
    }
}

/****************************************************************************
 * Name: rt_timer_setisr
 *
 * Description:
 *   Allocate a CPU Interrupt, connect the peripheral source to this
 *   Interrupt, register the callback and enable the CPU Interrupt.
 *   In case a NULL handler is provided, deallocate the interrupt and
 *   unregister the previously provided handler.
 *
 * Input Parameters:
 *   handler       - Callback to be invoked on timer interrupt.
 *   arg           - Argument to be passed to the handler callback.
 *
 * Returned Values:
 *   Zero (OK) is returned on success. A negated errno value is returned to
 *   indicate the nature of any failure.
 *
 ****************************************************************************/

static int rt_timer_setisr(xcpt_t handler, void *arg)
{
  struct esp32s3_rt_priv_s *priv = &g_rt_priv;
  int ret = OK;

  /* Disable interrupt when callback is removed. */

  if (handler == NULL)
    {
      /* If a CPU Interrupt was previously allocated, then deallocate it */

      if (priv->cpuint != -ENOMEM)
        {
          /* Disable CPU Interrupt, free a previously allocated
           * CPU Interrupt
           */

          up_disable_irq(ESP32S3_IRQ_SYSTIMER_TARGET2);
          esp32s3_teardown_irq(priv->core, ESP32S3_PERIPH_SYSTIMER_TARGET2,
                               priv->cpuint);
          irq_detach(ESP32S3_IRQ_SYSTIMER_TARGET2);

          priv->cpuint = -ENOMEM;
          priv->core   = -ENODEV;
        }
    }

  /* Otherwise set callback and enable interrupt */

  else
    {
      if (priv->cpuint != -ENOMEM)
        {
          /* Disable the previous IRQ */

          up_disable_irq(ESP32S3_IRQ_SYSTIMER_TARGET2);
        }

      /* Set up to receive peripheral interrupts on the current CPU */

      priv->core = this_cpu();
      priv->cpuint = esp32s3_setup_irq(priv->core,
                                       ESP32S3_PERIPH_SYSTIMER_TARGET2,
                                       1, ESP32S3_CPUINT_LEVEL);
      if (priv->cpuint < 0)
        {
          tmrerr("ERROR: No CPU Interrupt available");
          ret = priv->cpuint;
          goto errout;
        }

      /* Associate an IRQ Number (from the timer) to an ISR */

      ret = irq_attach(ESP32S3_IRQ_SYSTIMER_TARGET2, handler, arg);
      if (ret != OK)
        {
          esp32s3_teardown_irq(priv->core, ESP32S3_PERIPH_SYSTIMER_TARGET2,
                               priv->cpuint);
          tmrerr("ERROR: Failed to associate an IRQ Number");
          goto errout;
        }

      /* Enable the CPU Interrupt that is linked to the timer */

      up_enable_irq(ESP32S3_IRQ_SYSTIMER_TARGET2);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: start_rt_timer
 *
 * Description:
 *   Start the timer by inserting it into the running list and reset the
 *   hardware timer alarm value if this timer is at the head of the list.
 *   Larger timeouts go to the end of the list (tail).
 *
 * Input Parameters:
 *   timer         - Pointer to the RT Timer state structure.
 *   timeout       - Timeout value.
 *   repeat        - Repeat mode (true: enabled, false: disabled).
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void start_rt_timer(struct rt_timer_s *timer,
                           uint64_t timeout,
                           bool repeat)
{
  struct esp32s3_rt_priv_s *priv = &g_rt_priv;

  /* Only idle timer can be started */

  if (timer->state == RT_TIMER_IDLE)
    {
      struct rt_timer_s *temp_p;
      bool inserted = false;

      /* Calculate the timer's alarm value */

      uint64_t counter = rt_timer_getcounter();
      counter = CYCLES_TO_USEC(counter);
      timer->timeout = timeout;
      timer->alarm = timer->timeout + counter;

      if (repeat)
        {
          timer->flags |= RT_TIMER_REPEAT;
        }
      else
        {
          timer->flags &= ~RT_TIMER_REPEAT;
        }

      /* Scan the timer list and insert the new timer into previous node of
       * timer whose alarm value is larger than new one.
       */

      list_for_every_entry(&priv->runlist, temp_p, struct rt_timer_s, list)
        {
          if (temp_p->alarm > timer->alarm)
            {
              list_add_before(&temp_p->list, &timer->list);
              inserted = true;
              break;
            }
        }

      /* If we didn't find a larger one, insert the new timer at the tail of
       * the list.
       */

      if (!inserted)
        {
          list_add_tail(&priv->runlist, &timer->list);
        }

      timer->state = RT_TIMER_READY;

      /* Check if this timer is at the head of the list */

