apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rt_timer.c
      if (timer == container_of(priv->runlist.next, struct rt_timer_s, list))
        {
          /* Reset the hardware timer alarm */

          rt_timer_setalarm(false);
          rt_timer_setalarmvalue(USEC_TO_CYCLES(timer->alarm));
          rt_timer_setalarm(true);
        }
    }
  else
    {
      tmrwarn("Timer not in idle mode. Only idle timer can be started!\n");
    }
}

/****************************************************************************
 * Name: stop_rt_timer
 *
 * Description:
 *   Stop the timer by removing it from the running list and reset the
 *   hardware timer alarm value if this timer is at the head of list.
 *
 * Input Parameters:
 *   timer         - Pointer to the RT Timer state structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void stop_rt_timer(struct rt_timer_s *timer)
{
  struct esp32s3_rt_priv_s *priv = &g_rt_priv;

  /* "start" function can set the timer's repeat flag, and "stop" function
   * should remove this flag.
   */

  timer->flags &= ~RT_TIMER_REPEAT;

  /* Only timers in "ready" state can be stopped */

  if (timer->state == RT_TIMER_READY)
    {
      bool ishead;

      /* Check if the timer is at the head of the list */

      if (timer == container_of(priv->runlist.next,
                                struct rt_timer_s, list))
        {
          ishead = true;
        }
      else
        {
          ishead = false;
        }

      list_delete(&timer->list);
      timer->state = RT_TIMER_IDLE;

      if (ishead)
        {
          if (!list_is_empty(&priv->runlist))
            {
              /* Set the value from the next timer as the new hardware timer
               * alarm value.
               */

              struct rt_timer_s *next_timer =
                container_of(priv->runlist.next, struct rt_timer_s, list);

              rt_timer_setalarm(false);
              rt_timer_setalarmvalue(USEC_TO_CYCLES(next_timer->alarm));
              rt_timer_setalarm(true);
            }
        }
    }
}

/****************************************************************************
 * Name: rt_timer_thread
 *
 * Description:
 *   RT Timer working thread: Waits for a timeout semaphore, scans the
 *   timeout list and processes all the timers in the list.
 *
 * Input Parameters:
 *   argc          - Not used.
 *   argv          - Not used.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned to
 *   indicate the nature of any failure.
 *
 ****************************************************************************/

static int rt_timer_thread(int argc, char *argv[])
{
  struct esp32s3_rt_priv_s *priv = &g_rt_priv;

  while (1)
    {
      /* Waiting for all timers to time out */

      DEBUGVERIFY(nxsem_wait_uninterruptible(&priv->toutsem));

      irqstate_t flags = spin_lock_irqsave(&priv->lock);

      /* Process all the timers in list */

      while (!list_is_empty(&priv->toutlist))
        {
          /* Get the first timer in the list */

          struct rt_timer_s *timer = container_of(priv->toutlist.next,
                                                  struct rt_timer_s, list);

          /* Cache the raw state to decide how to deal with this timer */

          enum rt_timer_state_e raw_state = timer->state;

          /* Delete the timer from the list */

          list_delete(&timer->list);

          /* Set timer's state to idle so it can be restarted by the user. */

          timer->state = RT_TIMER_IDLE;

          spin_unlock_irqrestore(&priv->lock, flags);

          if (raw_state == RT_TIMER_TIMEOUT)
            {
              timer->callback(timer->arg);
            }
          else if (raw_state == RT_TIMER_DELETE)
            {
              kmm_free(timer);
            }

          /* Enter critical section for next scanning list */

          flags = spin_lock_irqsave(&priv->lock);

          if (raw_state == RT_TIMER_TIMEOUT)
            {
              /* Check if the timer is in "repeat" mode */

              if ((timer->flags & RT_TIMER_REPEAT) != 0)
                {
                  start_rt_timer(timer, timer->timeout, true);
                }
            }
        }

      spin_unlock_irqrestore(&priv->lock, flags);
    }

  return OK;
}

/****************************************************************************
 * Name: rt_timer_isr
 *
 * Description:
 *   Hardware timer interrupt service routine.
 *
 * Input Parameters:
 *   dev           - Pointer to the driver state structure.
 *   handler       - Callback to be invoked on timer interrupt.
 *   arg           - Argument to be passed to the handler callback.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned to
 *   indicate the nature of any failure.
 *
 ****************************************************************************/

static int rt_timer_isr(int irq, void *context, void *arg)
{
  irqstate_t flags;
  bool wake = false;
  struct esp32s3_rt_priv_s *priv = &g_rt_priv;

  /* Clear interrupt register status */

  modifyreg32(SYSTIMER_INT_CLR_REG, 0, SYSTIMER_TARGET2_INT_CLR);

  flags = spin_lock_irqsave(&priv->lock);

  /* Check if there is a timer running */

  if (!list_is_empty(&priv->runlist))
    {
      struct rt_timer_s *timer;

      /* When stop/delete timer, at the same time the hardware timer
       * interrupt triggers, function "stop/delete" removes the timer
       * from running list, so the timer at head is not is not the one being
       * triggered.
       */

      uint64_t counter = rt_timer_getcounter();
      counter = CYCLES_TO_USEC(counter);
      timer = container_of(priv->runlist.next, struct rt_timer_s, list);
      if (timer->alarm <= counter)
        {
          /* Remove the first timer from the running list and add it to
           * the timeout list.
           *
           * Set the timer's state to RT_TIMER_TIMEOUT to avoid any other
           * operations.
           */

