apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rt_timer.c
  pid = kthread_create(RT_TIMER_TASK_NAME,
                       RT_TIMER_TASK_PRIORITY,
                       RT_TIMER_TASK_STACK_SIZE,
                       rt_timer_thread,
                       NULL);
  if (pid < 0)
    {
      tmrerr("ERROR: Failed to create RT Timer task error=%d\n", pid);
      return pid;
    }

  list_initialize(&priv->runlist);
  list_initialize(&priv->toutlist);

  priv->pid = (pid_t)pid;

  flags = spin_lock_irqsave(&priv->lock);

  /* ESP32-S3 hardware timer configuration:
   * 1 count = 1/16 us
   * 1) Set Alarm mode (non-periodic).
   * 2) Clear the counter.
   * 3) Set the ISR.
   * 4) Enable timeout interrupt.
   * 5) Start the counter.
   * NOTE: No interrupt will be triggered until rt_timer_setalarm is set.
   */

  /* Clock and reset of Systimer peripheral is already performed in
   * up_timer_initialize(), either in esp32s3_timerisr.c or in
   * esp32s3_tickless.c.
   * Set comparator 2 to use counter 1 and set the mode to oneshot mode,
   * i.e., disable periodic mode.
   */

  modifyreg32(SYSTIMER_TARGET2_CONF_REG, SYSTIMER_TARGET2_PERIOD_MODE,
              SYSTIMER_TARGET2_TIMER_UNIT_SEL);

  rt_timer_setcounter(0);
  rt_timer_setisr(rt_timer_isr, NULL);

  /* Ensure Systimer 1 keeps running even when the CPUs are temporarily
   * stalled.
   * This is required for the correct operation of the Wi-Fi driver.
   */

  modifyreg32(SYSTIMER_CONF_REG, SYSTIMER_TIMER_UNIT1_CORE0_STALL_EN, 0);
  modifyreg32(SYSTIMER_CONF_REG, SYSTIMER_TIMER_UNIT1_CORE1_STALL_EN, 0);

  /* Enable interrupts */

  modifyreg32(SYSTIMER_INT_CLR_REG, 0, SYSTIMER_TARGET2_INT_CLR);
  modifyreg32(SYSTIMER_INT_ENA_REG, 0, SYSTIMER_TARGET2_INT_ENA);

  /* Start counter 1 */

  modifyreg32(SYSTIMER_CONF_REG, 0, SYSTIMER_TIMER_UNIT1_WORK_EN);

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_rt_timer_deinit
 *
 * Description:
 *   Deinitialize ESP32-S3 RT Timer.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32s3_rt_timer_deinit(void)
{
  irqstate_t flags;
  struct esp32s3_rt_priv_s *priv = &g_rt_priv;

  flags = spin_lock_irqsave(&priv->lock);

  /* Stop counter 1 */

  modifyreg32(SYSTIMER_CONF_REG, SYSTIMER_TIMER_UNIT1_WORK_EN, 0);

  /* Disable interrupts */

  modifyreg32(SYSTIMER_INT_ENA_REG, SYSTIMER_TARGET2_INT_ENA, 0);
  modifyreg32(SYSTIMER_INT_CLR_REG, SYSTIMER_TARGET2_INT_CLR, 0);

  rt_timer_setisr(NULL, NULL);

  spin_unlock_irqrestore(&priv->lock, flags);

  if (priv->pid != INVALID_PROCESS_ID)
    {
      kthread_delete(priv->pid);
      priv->pid = INVALID_PROCESS_ID;
    }
}
